from flask import Flask, request, jsonify

app = Flask(__name__)

@app.route('/analyze_stress', methods=['POST'])
def analyze_stress():
    try:
        data = request.get_json()
        survey = data.get('survey', {}) # Χρησιμοποιούμε {} για να επιστρέψουμε ένα κενό λεξικό αν δεν υπάρχει το κλειδί
        health = data.get('health', {})
        
        v1 = survey.get('v1', 2) # Αν δεν υπάρχει το κλειδί 'v1', επιστρέφουμε μια ασφαλή τιμή
        v2 = survey.get('v2', 2)  
        v3 = survey.get('v3', 2)
        
        steps = health.get('steps', 0) # Αν δεν υπάρχει το κλειδί 'steps', επιστρέφουμε 0
        sleep_hours = health.get('sleep_hours', 0.0) 
        heart_rate = health.get('heart_rate', 70.0)  # Αν δεν υπάρχει το κλειδί 'heart_rate', επιστρέφουμε 70.0 και έτσι στην διαίρεση θα έχουμε 1
        hrv = health.get('hrv', 50.0) # Αν δεν υπάρχει το κλειδί 'hrv', επιστρέφουμε 50.0 και έτσι στην διαίρεση θα έχουμε 1
        
        is_morning = data.get('is_morning', True) # Αν δεν υπάρχει το κλειδί 'is_morning', επιστρέφουμε True
        
        # Υπολογισμός του δείκτη στρες
         
        # Τα αποτελέσματα του survey είναι από 1 έως 3, τα πολλαπλασιάζουμε με 2.5 για να τα απλώσουμε σε κλίμακα 1-7.5
        # Τα βήματα και οι ώρες ύπνου μειώνουν τον δείκτη στρες, ενώ ο καρδιακός ρυθμός και η μεταβλητότητα του καρδιακού ρυθμού τον αυξάνουν
        stress_index = (((v1 + v2 + v3) / 3)*2.5) - (steps / 10000) - (sleep_hours / 8) + (heart_rate / 70) - (hrv / 50)
        health_score = max(0.0, min(10.0, stress_index))  # Περιορίζουμε το αποτέλεσμα σε κλίμακα 0-10
        
        if is_morning:
            if health_score <= 4:
                insight = "Ξεκινάς τη μέρα σου με υπέροχο vibe! Το σώμα σου είναι ξεκούραστο και οι παλμοί σου ήρεμοι. Κράτα αυτή τη θετική ενέργεια!"
            elif health_score <= 7: 
                insight = "Η μέρα έχει μέτρια πίεση σήμερα... αλλά το πας πολύ καλά. Θυμήσου να πίνεις νερό και να παίρνεις μικρές ανάσες ανάμεσα στις υποχρεώσεις σου."
            else:
                insight = "Φαίνεται πως η μέρα ξεκίνησε με αρκετή πίεση. Μην ξεχνάς... ένα βήμα τη φορά. Αν μπορείς, κάνε ένα 5λεπτο διάλειμμα τώρα αμέσως για να αποφορτιστείς."
        else:
            if health_score <= 4:
                insight = "Η μέρα κλείνει με πολύ όμορφο τρόπο. Το σώμα και το μυαλό βρίσκονται σε κατάσταση ηρεμίας, ιδανική για χαλάρωση και καλό ύπνο."
            elif health_score <= 7:
                insight = "Μια γεμάτη μέρα ολοκληρώθηκε. Ώρα να αφήσεις στην άκρη τις εκκρεμότητες και να χαρίσεις στον εαυτό σου λίγο χρόνο αποφόρτισης."
            else:
                insight = "Η πίεση της ημέρας ήταν έντονη. Δώσε άμεση προτεραιότητα στην αποσυμπίεση... δoκίμασε μερικές βαθιές αναπνοές και αποσυνδέσου από τις οθόνες."
            
        return jsonify({"health_score": round(health_score, 1), "insight": insight}), 200 #επιστρέφουμε το αποτέλεσμα σε μορφή JSON, με το health_score στρογγυλοποιημένο στο πρώτο δεκαδικό ψηφίο
   
    except Exception as e:
        print("Σφάλμα στον υπολογισμό:", e)
        return jsonify({"error": str(e)}), 400

    
# Εκκίνηση του Flask
if __name__ == '__main__':
    app.run(debug=True, host='0.0.0.0', port=5000)